Repository: ducheng121/TinyStory
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# 1. 回到主屏幕，长按空白处。
source: 1. On your Home Screen, touch and hold an empty area.
zh_hans: 1. 回到主屏幕，长按空白处。

# 2. 点击「编辑」→「添加小组件」。
source: 2. Tap Edit, then Add Widget.
zh_hans: 2. 点击「编辑」→「添加小组件」。

# 3. 搜索「小小奇遇」，添加中号小组件。
source: 3. Search for TinyStory (小小奇遇 on a Chinese system) and add the medium widget.
zh_hans: 3. 搜索「小小奇遇」，添加中号小组件。

# 上一页
source: Previous
zh_hans: 上一页

# 下一页
source: Next page
zh_hans: 下一页

# 不需要登录，也不需要联网。当前不提供云同步，删除 App 后数据可能无法恢复。
source: No account or internet needed. Cloud sync is not available. Deleting the app may permanently remove your data.
zh_hans: 不需要登录，也不需要联网。当前不提供云同步，删除 App 后数据可能无法恢复。

# 优先未完成：按目录寻找尚未读完的故事，接着原进度读。按列表顺序：直接进入下一篇。遇到已完成故事会重新开始，已收藏结局保留。
source: Unfinished first: continue the next unfinished story in library order. Library order: go straight to the next story. Completed stories restart, keeping collected endings.
zh_hans: 优先未完成：按目录寻找尚未读完的故事，接着原进度读。按列表顺序：直接进入下一篇。遇到已完成故事会重新开始，已收藏结局保留。

# 关于小小奇遇
source: About TinyStory
zh_hans: 关于小小奇遇

# 历史旅程
source: Past journeys
zh_hans: 历史旅程

# 取消
source: Cancel
zh_hans: 取消

# 四次选择，一段不同的故事。
source: Four choices. A different story.
zh_hans: 四次选择，一段不同的故事。

# 回顾这段旅程
source: Revisit this journey
zh_hans: 回顾这段旅程

source: Choose a story in its detail page. On your Home Screen, tap A or B to reach an ending in four choices. Restart or choose Next story right in the widget. By default, Next story continues an unfinished story; you can change this in Reading settings. Completed stories restart without losing endings. Each story keeps its progress, and all widgets show the same active story.
zh_hans: 在故事详情中选择要在桌面阅读的故事。返回主屏幕，点击 A 或 B，四次选择后获得结局。结局页可直接点「重新开始」或「换个故事」，无需打开 App。「换个故事」默认优先继续尚未完成的故事；也可在阅读设置中改为按列表顺序。遇到已完成故事会重新开始，收藏不丢失。切换故事会保留各自进度，所有小组件显示同一篇当前故事。

# 在桌面显示结局
source: Show ending in widget
zh_hans: 在桌面显示结局

# 在桌面读故事，在这里留下旅程。
source: Read on your Home Screen. Keep your journeys here.
zh_hans: 在桌面读故事，在这里留下旅程。

# 外观
source: Appearance
zh_hans: 外观

# 小小奇遇
source: TinyStory
zh_hans: 小小奇遇

# 尚未发现结局
source: No endings discovered yet
zh_hans: 尚未发现结局

# 已在桌面，返回小组件继续
source: On your Home Screen. Continue in the widget.
zh_hans: 已在桌面，返回小组件继续

# 已完成
source: Completed
zh_hans: 已完成

# 已探索分支图
source: Explored branches
zh_hans: 已探索分支图

# 开始阅读
source: Start reading
zh_hans: 开始阅读

# 我的旅程
source: My Journeys
zh_hans: 我的旅程

# 按钮保持橙色，App 外观跟随系统。
source: Buttons stay orange. The app follows your system appearance.
zh_hans: 按钮保持橙色，App 外观跟随系统。

# 换个故事
source: Next story
zh_hans: 换个故事

# 换故事顺序
source: Next story order
zh_hans: 换故事顺序

# 探索与回顾
source: Explore and revisit
zh_hans: 探索与回顾

# 故事书架
source: Bookshelf
zh_hans: 故事书架

# 故事和进度均保存在本机，不需要联网。重新开始会保留已发现结局和历史旅程。当前不提供云同步或备份，删除 App 后数据可能无法恢复。
source: Stories and progress stay on your device. No internet is needed. Restarting keeps discovered endings and past journeys. Cloud sync and backups are not available; deleting the app may permanently remove your data.
zh_hans: 故事和进度均保存在本机，不需要联网。重新开始会保留已发现结局和历史旅程。当前不提供云同步或备份，删除 App 后数据可能无法恢复。

# 故事库
source: Library
zh_hans: 故事库

# 故事开始
source: Story begins
zh_hans: 故事开始

# 旅程回顾
source: Journey review
zh_hans: 旅程回顾

# 暂时无法读取进度，请在 App 中重试。
source: Unable to load progress. Please try again in the app.
zh_hans: 暂时无法读取进度，请在 App 中重试。

# 未完成的旅程
source: An unfinished journey
zh_hans: 未完成的旅程

# 未探索
source: Unexplored
zh_hans: 未探索

# 本地保存
source: Local storage
zh_hans: 本地保存

# 本轮剧情路径
source: Current path
zh_hans: 本轮剧情路径

# 本轮继续旧版剧情；重新开始后进入新版分支，旧旅程和结局会保留。
source: This run uses the original edition. Restart to play the new branches. Past journeys and endings will be kept.
zh_hans: 本轮继续旧版剧情；重新开始后进入新版分支，旧旅程和结局会保留。

# 本轮路径将存入历史旅程，已收藏的结局会保留。桌面将切换到这篇故事。
source: Your current path will be saved in your journey history. Collected endings will stay. The widget will switch to this story.
zh_hans: 本轮路径将存入历史旅程，已收藏的结局会保留。桌面将切换到这篇故事。

# 查看当前故事
source: View current story
zh_hans: 查看当前故事

# 查看本轮剧情路径
source: View current path
zh_hans: 查看本轮剧情路径

# 桌面正在显示这个结局
source: The widget is showing this ending.
zh_hans: 桌面正在显示这个结局

# 桌面阅读
source: Widget reading
zh_hans: 桌面阅读

# 桌面阅读指南
source: Widget guide
zh_hans: 桌面阅读指南

# 橙色连接表示走过的选择。未探索节点不显示剧情和结局名称。相同节点可能由不同路线到达。
source: Orange links mark choices you have made. Unexplored scenes and ending names stay hidden. Different paths may reach the same scene.
zh_hans: 橙色连接表示走过的选择。未探索节点不显示剧情和结局名称。相同节点可能由不同路线到达。

# 正在桌面
source: On your Home Screen
zh_hans: 正在桌面

# 正在读取故事…
source: Loading stories…
zh_hans: 正在读取故事…

# 正文分页不计入剧情选择，请读完后选择 A/B。
source: Pages do not count as story choices. Read to the last page to choose A or B.
zh_hans: 正文分页不计入剧情选择，请读完后选择 A/B。

# 添加小组件
source: Add a widget
zh_hans: 添加小组件

# 离线阅读 · 进度保存在本机
source: Offline · Progress saved on this device
zh_hans: 离线阅读 · 进度保存在本机

# 结局
source: Ending
zh_hans: 结局

# 结局收藏
source: Endings
zh_hans: 结局收藏

# 设置
source: Settings
zh_hans: 设置

# 设置与进度只保存在这台设备。切换故事不会清空其他故事进度。
source: Settings and progress stay on this device. Switching stories keeps each story's progress.
zh_hans: 设置与进度只保存在这台设备。切换故事不会清空其他故事进度。

# 语言
source: Language
zh_hans: 语言

# 语言同时应用于 App 和小组件，不改变故事进度。
source: Language applies to the app and widget without changing your progress.
zh_hans: 语言同时应用于 App 和小组件，不改变故事进度。

# 读到故事结尾后，会将结局收藏在这里。
source: Finish a story to collect its ending here.
zh_hans: 读到故事结尾后，会将结局收藏在这里。

# 读到结局时自动保存；中途重新开始也会保留已走路径。历史旅程保留当时的正文和选择。
source: Completed stories are saved automatically. Restarting also saves your unfinished path. History keeps the text and choices from that run.
zh_hans: 读到结局时自动保存；中途重新开始也会保留已走路径。历史旅程保留当时的正文和选择。

# 读到这里
source: You reached here
zh_hans: 读到这里

# 读取未完成
source: Unable to load
zh_hans: 读取未完成

# 跟随系统
source: Follow system
zh_hans: 跟随系统

# 还没有历史旅程。完成故事或重新开始后，可以在这里回顾。
source: No past journeys yet. Complete a story or restart to revisit your path here.
zh_hans: 还没有历史旅程。完成故事或重新开始后，可以在这里回顾。

# 这是根据升级时保留的选择记录恢复的路径，使用旧版剧情文本；更早已重玩的记录无法补回。
source: This path was reconstructed from choices saved during an upgrade, using the original text. Earlier runs that were already erased cannot be recovered.
zh_hans: 这是根据升级时保留的选择记录恢复的路径，使用旧版剧情文本；更早已重玩的记录无法补回。

# 进度与隐私
source: Progress and privacy
zh_hans: 进度与隐私

# 重新开始
source: Restart
zh_hans: 重新开始

# 重新开始这篇故事？
source: Restart this story?
zh_hans: 重新开始这篇故事？

# 重试
source: Try again
zh_hans: 重试

# 阅读
source: Reading
zh_hans: 阅读

# 阅读概览
source: Reading overview
zh_hans: 阅读概览

# 阅读设置
source: Reading settings
zh_hans: 阅读设置

source: A short story in four choices, right on your Home Screen.
zh_hans: 直接选择，四次选择，读完一个短故事。

source: Action
zh_hans: 操作

source: Choice
zh_hans: 选项

source: Choose a story branch
zh_hans: 选择剧情分支

source: Continue reading
zh_hans: 继续桌面阅读

source: Direction
zh_hans: 方向

source: Language
zh_hans: 语言

source: Page
zh_hans: 页码

source: Run
zh_hans: 本轮

source: Scene
zh_hans: 节点

source: TinyStory
zh_hans: 小小奇遇

source: Turn a page
zh_hans: 翻阅正文
